# GetAlternateUnitsFormatOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionType..::..GetAlternateUnitsFormatOptions Method
DimensionType Class See Also
---
Gets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FormatOptions GetAlternateUnitsFormatOptions()
```

Visual Basic
---
```text
Public Function GetAlternateUnitsFormatOptions As FormatOptions
```

Visual C++
---
```text
public:
FormatOptions^ GetAlternateUnitsFormatOptions()
```

# ### Return Value
A copy of the FormatOptions.
# See Also
DimensionType Class
Autodesk.Revit.DB Namespace